# Taps
tap 'aws/tap'
tap 'buildpacks/tap'
tap 'coursier/formulas'
tap 'gabrie30/utils'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'jesseduffield/lazygit'
tap 'scalacenter/bloop'
tap 'virtuslab/scala-cli'
tap 'FelixKratz/formulae'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat'
brew 'borders'
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'hyperfine'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'svn' # Needed to install fonts
brew 'zoxide'
brew 'sketchybar'

# Development
brew 'caddy'
brew 'delta'
brew 'go'
brew 'imagemagick'
brew 'neovim'
brew 'nvm'
brew 'rust'
brew 'rust-analyzer'
brew 'task'
brew 'tmux'

# Apps
cask '1password'
cask 'adobe-creative-cloud'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'jetbrains-toolbox'
cask 'maccy'
cask 'microsoft-teams'
cask 'nikitabobko/tap/aerospace'
cask 'numi'
cask 'obsidian'
cask 'postman'
cask 'slack'
cask 'tailscale'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'

# Fonts
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-meslo-lg-nerd-font'

# Mac App Store
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
